package org.kgbcomrade.dz1

val digits12 = arrayOf("один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять",
        "десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семьнадцать",
        "восемьнадцать", "девятнадцать")
val digits2 = arrayOf("двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто")
val digits3 = arrayOf("сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот")

fun numToText(num : Int) : String {
    if(num == 0)
        return ""

    var res = ""

    if(num / 1000 == 1)
        res += " тысяча"

    if((num % 1000) / 100 != 0)
        res += " " + digits3[(num % 1000) / 100 - 1]

    if(num % 100 in 10..19)
        res += " " + digits12[num % 100 - 1]
    else {
        if(num % 100 >= 20)
            res += " " + digits2[(num % 100) / 10 - 2]

        if(num % 10 != 0)
            res += " " + digits12[num % 10 - 1]
    }


    return res.substring(1)
}